Revit 2020 API
UnitFormatUtils.TryParse Method (Units, UnitType, String, ValueParsingOptions, Double)
 Parses a formatted string into a number with units if possible.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2014
Syntax
C#
public static bool TryParse(
	Units units,
	UnitType unitType,
	string stringToParse,
	ValueParsingOptions valueParsingOptions,
	out double value
)
Visual Basic
Public Shared Function TryParse ( _
	units As Units, _
	unitType As UnitType, _
	stringToParse As String, _
	valueParsingOptions As ValueParsingOptions, _
	<OutAttribute> ByRef value As Double _
) As Boolean
Visual C++
public:
static bool TryParse(
	Units^ units,
	UnitType unitType,
	String^ stringToParse,
	ValueParsingOptions^ valueParsingOptions,
	[OutAttribute] double% value
)
Parameters
units
Type: Autodesk.Revit.DB.Units
 The units formatting settings, typically obtained from Document.GetUnits().
unitType
Type: Autodesk.Revit.DB.UnitType
 The target unit type for the value.
stringToParse
Type: System.String
 The string to parse.
valueParsingOptions
Type: Autodesk.Revit.DB.ValueParsingOptions
 Additional parsing options.
value
Type: System.Double
 The parsed value, in Revit's internal units. Ignore this value if the function returns false.
Return Value
 True if the string can be parsed, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  unitType is an invalid unit type. See UnitUtils.IsValidUnitType() and UnitUtils.GetValidUnitTypes(). -or- The display unit in the FormatOptions in valueParsingOptions is not a valid display unit for unitType. See UnitUtils.IsValidDisplayUnit(UnitType, DisplayUnitType) and UnitUtils.GetValidDisplayUnits(UnitType).
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
UnitFormatUtils Class
TryParse Overload
Autodesk.Revit.DB Namespace